app/controllers/admins_backoffice/admins_controller.rb

SELECT COUNT(*) FROM "admins"
SELECT "admins".* FROM "admins"
---
  def index
      @admins = Admin.all.page(params[:page])

UPDATE "admins" SET "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["encrypted_password", "$2a$12$ELax1s2jdtIFn.MNCM/bD./5kTccJ8DF8uFMeJV3PpJInJS80AzQO"], ["updated_at", "2023-07-14 13:37:46.769076"], ["id", 2]]
---
  def update
    if @admin.update(params_admin)