app/controllers/admins_backoffice/admins_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    @admin = Admin.find(params[:id])