app/controllers/admins_backoffice/subjects_controller.rb

    def index
        @subjects = Subject.all.page(params[:page])
---
SELECT  "subjects".* FROM "subjects" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"

    def create
      @subject = Subject.new(params_subject)
      if @subject.save
---
INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Algoritmos"], ["created_at", "2023-07-18 17:52:25.065747"], ["updated_at", "2023-07-18 17:52:25.065747"]]

    def update
      if @subject.update(params_subject)
---
UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Administração de Recursos Materiaisssssss"], ["updated_at", "2023-07-18 17:52:06.798267"], ["id", 506]]

  def destroy
    if @subject.destroy
---
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 524]]